---
kind: property
id: P:Autodesk.Revit.DB.Path3d.NumCurveLoops
source: html/90c888b4-ccc4-41ec-7ab1-c6bf9ede8cc0.htm
---
# Autodesk.Revit.DB.Path3d.NumCurveLoops Property

Get the Number of Curve Loops of Path3d.

## Syntax (C#)
```csharp
public int NumCurveLoops { get; }
```

## Remarks
Returns the Number of Curve Loops of Path3d.